import os
import re

categoryDic = {
    '907': 1,               # 채소
    '908': 10,              # 과일
    '909': 18,              # 수산
    '910': 28,              # 정육
    '911': 36,              # 국
    '912': 43,              # 셀러드
    '913': 52,              # 면
    '914': 60,              # 생수
    '249': 66,              # 간식
    '915': 71,              # 베이커리
    '032': 78,              # 건강식품
    '918': 86,              # 생활용품
    '012': 93,              # 뷰티
    '916': 99,              # 주방용품
    '085': 106,             # 가전제품
    '919': 110,             # 베이비
    '991': 120,             # 반려동물
    '고구마·감자·당근': 2,
    '시금치·쌈채소·나물': 3,
    '시금치·쌈채소·나물': 4,
    '브로콜리·파프리카·양배추': 5,
    '양파·대파·마늘·배추': 6,
    '오이·호박·고추': 7,
    '냉동·이색·간편채소': 8,
    '콩나물·버섯': 9,
    '제철과일': 11,
    '국산과일': 12,
    '수입과일': 13,
    '간편과일': 14,
    '냉동·건과일': 15,
    '견과류': 16,
    '쌀·잡곡': 17,
    '제철수산': 19,
    '생선류': 20,
    '굴비·반건류': 21,
    '오징어·낙지·문어': 22,
    '새우·게·랍스터': 23,
    '해산물·조개류': 24,
    '수산가공품': 25,
    '김·미역·해조류': 26,
    '건어물·다시팩': 27,
    '국내산 소고기': 29,
    '수입산 소고기': 30,
    '돼지고기': 31,
    '계란류': 32,
    '닭·오리고기': 33,
    '양념육·돈까스': 34,
    '양고기': 35,
    '국·탕·찌개': 37,
    '밀키트·메인요리': 38,
    '밑반찬': 39,
    '김치·젓갈·장류': 40,
    '두부·어묵·부침개': 41,
    '베이컨·햄·통조림': 42,
    '샐러드·닭가슴살': 44,
    '도시락·밥류': 45,
    '파스타·면류': 46,
    '떡볶이·튀김·순대': 47,
    '피자·핫도그·만두': 48,
    '폭립·떡갈비·안주': 49,
    '죽·스프·카레': 50,
    '선식·시리얼': 51,
    '파스타·면류': 53,
    '식초·소스·드레싱': 54,
    '양념·액젓·장류': 55,
    '양념·액젓·장류': 56,
    '식용유·참기름·오일': 57,
    '소금·설탕·향신료': 58,
    '밀가루·가루·믹스': 59,
    '생수·탄산수': 61,
    '음료·주스': 62,
    '우유·두유·요거트': 63,
    '커피': 64,
    '차': 65,
    '과자·스낵·쿠키': 67,
    '초콜릿·젤리·캔디': 68,
    '떡·한과': 69,
    '아이스크림': 70,
    '식빵·빵류': 72,
    '잼·버터·스프레드': 73,
    '케이크·파이·디저트': 74,
    '치즈': 75,
    '델리': 76,
    '올리브·피클': 77,
    '영양제': 79,
    '유산균': 80,
    '홍삼·인삼·꿀': 81,
    '건강즙·건강음료': 82,
    '건강분말·건강환': 83,
    '다이어트·이너뷰티': 84,
    '유아동': 85,
    '휴지·티슈': 87,
    '여성·위생용품': 88,
    '세제·청소용품': 89,
    '화훼·인테리어소품': 90,
    '의약외품·마스크': 91,
    '생활잡화·문구': 92,
    '스킨케어': 94,
    '구강·면도': 95,
    '바디·제모': 96,
    '헤어케어': 97,
    '미용기기·소품': 98,
    '주방소모품·잡화': 100,
    '주방·조리도구': 101,
    '냄비·팬·솥': 102,
    '보관용기·텀블러': 103,
    '식기·테이블웨어': 104,
    '컵·잔·커피도구': 105,
    '주방가전': 107,
    '생활가전': 108,
    '계절가전': 109,
    '분유·간편 이유식': 111,
    '이유식 재료': 112,
    '간식·음식·음료': 113,
    '건강식품': 114,
    '이유·수유용품': 115,
    '기저귀·물티슈': 116,
    '세제·위생용품': 117,
    '스킨·구강케어': 118,
    '완구·잡화류': 119,
    '강아지 간식': 121,
    '강아지 주식': 122,
    '고양이 간식': 123,
    '고양이 주식': 124,
    '반려동물 용품': 125,
    '배변·위생': 126,
    '소용량·샘플': 127
}

def generateQuery():
    list = ''
    sql = '''insert into product(pno, quantity, brand, name, subject, sel_unit, weight, discount, price, ctno, ctno1, ctno2) values(s_product.nextval,99,'{}','{}','{}','{}','{}','{}','{}','{}','{}','{}');\n'''
    query = ''

    with open(os.path.join('data','product.csv'), 'r', encoding='utf-8') as f:
        list = f.read()

    list = list.split('\n')
    i = 0

    for row in list:
        r = row.split(',')
        if len(r) == 6:
            brand = ''
            if r[2][0] == '[':
                brand = re.sub(r'(\[)(.*)(\])(.*)', '\\1\\2\\3', r[2])
            name = re.sub(r'\[(.*)\]', '', r[2])
            subject = r[5]
            subject = re.sub(r'&','', subject)
            subject = re.sub(r'\'',' ', subject)
            restr = re.sub(r'(.*)(\()(.*)(\))', '\\1', subject)
            restr = r[5].replace(restr, '')
            restr = restr.split('/')
            sel_unit = restr[0]
            weight = ''
            if len(restr) > 1:
                weight = restr[1]
            discount = 0
            if r[3] != '':
                discount = r[3]
            price = r[4]
            ctno = categoryDic[r[0]]
            ctno1 = categoryDic[r[1]]
            ctno2 = ''
            brand = re.sub(r'&','', brand)
            brand = re.sub(r'\'',' ', brand)
            name = re.sub(r'&','', name)
            name = re.sub(r'\'',' ', name)
            query += sql.format(brand, name, subject, sel_unit, weight, discount, price, ctno, ctno1, ctno2)

    with open(os.path.join('data','product.sql'), 'w', encoding='utf-8') as f:
        f.write(query)

generateQuery()